import { type DefaultTheme } from "vitepress";
import { TutorialSidebar } from "./tutorialSidebar.mts";
export const Nav: DefaultTheme.NavItem[] = [
  {
    text: "Home",
    link: "/",
  },
  {
    text: "总纲",
    link: "/教程/正文/总纲",
  },
  {
    text: "关于",
    link: "/About",
  },
  {
    text: "组件展示",
    link: "/杂项/组件展示",
  },
  {
    text: "Gentorial",
    link: "/gentorial-integration",
  },
];
export const Sidebar: DefaultTheme.Sidebar = {
  "/教程/正文/": TutorialSidebar,
  "/教程/番外": [
    {
      text: "番外目录",
    },
  ],
  "/杂项": [
    {
      text: "杂项目录",
      items: [
        {
          text: "梦猫外传",
          collapsed: true,
          items: [
            {
              text: "-2. 梦开始的前兆",
              link: "/杂项/梦猫外传/-2_梦开始的前兆",
            },
          ],
        },
        {
          text: "给“纸质书”写的引言",
          link: "/杂项/分享/20241027",
        },
        {
          text: "VSCode 扩展",
          link: "/杂项/插件",
        },
        {
          text: "前端开发指南",
          link: "/杂项/前端",
        },
        {
          text: "组件展示",
          link: "/杂项/组件展示",
        },
      ],
    },
  ],
  "/教程/题解": [
    {
      text: "习题答案及解析",
      items: [
        {
          text: "快速导航",
          link: "/教程/题解/快速导航",
        },
        {
          text: "来源与许可",
          link: "/教程/题解/来源与许可",
        },
        {
          text: "[1] 语法和标准库",
          collapsed: false,
          items: [
            {
              text: "[101] 在开始编程之前",
              collapsed: true,
              items: [
                {
                  text: "10101 使用搜索引擎",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10101",
                },
                {
                  text: "10102 熟悉键盘",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10102",
                },
                {
                  text: "10103 学会提问",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10103",
                },
                {
                  text: "10105 C++ Reference",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10105",
                },
              ],
            },
            {
              text: "[102] 一个简单的 C 程序",
              collapsed: true,
              items: [
                {
                  text: "10101 编译运行示例",
                  link: "/教程/题解/语法和标准库/1_认识一个C程序/10101",
                },
                {
                  text: "10102 修改输出内容",
                  link: "/教程/题解/语法和标准库/1_认识一个C程序/10102",
                },
                {
                  text: "10310 整数除法",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10310",
                },
                {
                  text: "11407 触发断言",
                  link: "/教程/题解/语法和标准库/14_文本转换_错误与程序生命周期/11307",
                },
                {
                  text: "10103 理解 include",
                  link: "/教程/题解/语法和标准库/1_认识一个C程序/10103",
                },
              ],
            },
            {
              text: "[104] 表达式",
              collapsed: true,
              items: [
                {
                  text: "10301 优先级与括号",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10301",
                },
                {
                  text: "10302 表达式副作用",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10302",
                },
                {
                  text: "10303 安全算术表达式",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10303",
                },
                {
                  text: "10304 未排序的修改",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10304",
                },
                {
                  text: "10305 显式分组",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10305",
                },
                {
                  text: "10306 短路求值",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10306",
                },
                {
                  text: "10307 抽屉原理",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10307",
                },
                {
                  text: "10308 小公式",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10308",
                },
                {
                  text: "10309 2 的幂",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10309",
                },
                {
                  text: "10311 浮点转整数",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10311",
                },
                {
                  text: "10312 危险强制转换",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10312",
                },
                {
                  text: "10506 逗号运算符",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10505",
                },
                {
                  text: "10313 sizeof",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10313",
                },
                {
                  text: "10201 常量类型",
                  link: "/教程/题解/语法和标准库/2_值_对象_类型与声明/10101",
                },
                {
                  text: "10202 字符与除法",
                  link: "/教程/题解/语法和标准库/2_值_对象_类型与声明/10102",
                },
                {
                  text: "10203 判断奇偶性",
                  link: "/教程/题解/语法和标准库/2_值_对象_类型与声明/10310",
                },
                {
                  text: "10901 字符串拼接",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11601",
                },
                {
                  text: "10314 读写冲突",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10314",
                },
                {
                  text: "10315 值与副作用",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10315",
                },
                {
                  text: "10316 递增顺序",
                  link: "/教程/题解/语法和标准库/3_表达式与类型转换/10316",
                },
              ],
            },
            {
              text: "[105] 语句",
              collapsed: true,
              items: [
                {
                  text: "10501 输出字符串",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10401",
                },
                {
                  text: "10502 倒数平方和",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10501",
                },
                {
                  text: "10503 进制转换器",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10502",
                },
                {
                  text: "10504 乘二加一",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10503",
                },
                {
                  text: "10505 斐波那契数列",
                  link: "/教程/题解/语法和标准库/5_循环与跳转/10504",
                },
              ],
            },
            {
              text: "[106] 函数",
              collapsed: true,
              items: [
                {
                  text: "10601 填充字符",
                  link: "/教程/题解/语法和标准库/6_函数/10601",
                },
                {
                  text: "10602 自增自减函数",
                  link: "/教程/题解/语法和标准库/6_函数/10602",
                },
              ],
            },
            {
              text: "[107] 派生类型",
              collapsed: true,
              items: [
                {
                  text: "10701 矩阵加法",
                  link: "/教程/题解/语法和标准库/7_数组/10701",
                },
                {
                  text: "10702 割圆术",
                  link: "/教程/题解/语法和标准库/7_数组/10702",
                },
                {
                  text: "10703 生命游戏",
                  link: "/教程/题解/语法和标准库/7_数组/10703",
                },
                {
                  text: "10704 阶乘",
                  link: "/教程/题解/语法和标准库/7_数组/10704",
                },
                {
                  text: "10705 向量夹角",
                  link: "/教程/题解/语法和标准库/7_数组/10705",
                },
                {
                  text: "11001 复数结构体",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11701",
                },
                {
                  text: "11002 分数结构体",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11002",
                },
                {
                  text: "11004 RGB 与 HSV",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11004",
                },
                {
                  text: "11007 联合体类型转换器",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11007",
                },
                {
                  text: "11010 联合体内存布局",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11010",
                },
                {
                  text: "10801 指针反转",
                  link: "/教程/题解/语法和标准库/8_指针/10801",
                },
                {
                  text: "10802 回调计数",
                  link: "/教程/题解/语法和标准库/8_指针/10802",
                },
                {
                  text: "10803 通用稳定排序",
                  link: "/教程/题解/语法和标准库/8_指针/10803",
                },
                {
                  text: "11006 位域样式的可移植编码",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11006",
                },
                {
                  text: "11005 传感器批次汇总",
                  link: "/教程/题解/语法和标准库/10_枚举_结构与联合/11005",
                },
              ],
            },
            {
              text: "[109] 对象",
              collapsed: true,
              items: [
                {
                  text: "11601 基本概念辨析",
                  link: "/教程/题解/语法和标准库/16_对象与内存模型/10902",
                },
                {
                  text: "11602 未初始化对象",
                  link: "/教程/题解/语法和标准库/16_对象与内存模型/10904",
                },
                {
                  text: "11603 抽象机器",
                  link: "/教程/题解/语法和标准库/16_对象与内存模型/10903",
                },
              ],
            },
            {
              text: "[110] 预处理器",
              collapsed: true,
              items: [
                {
                  text: "11701 宏的重复求值",
                  link: "/教程/题解/语法和标准库/17_预处理与翻译/11901",
                },
              ],
            },
            {
              text: "[113] 错误处理",
              collapsed: true,
              items: [
                {
                  text: "11401 assert 与 errno",
                  link: "/教程/题解/语法和标准库/14_文本转换_错误与程序生命周期/11301",
                },
                {
                  text: "11402 parse_u32",
                  link: "/教程/题解/语法和标准库/14_文本转换_错误与程序生命周期/11302",
                },
                {
                  text: "11403 SIGINT 退出",
                  link: "/教程/题解/语法和标准库/14_文本转换_错误与程序生命周期/11303",
                },
              ],
            },
            {
              text: "[114] 输入输出",
              collapsed: true,
              items: [
                {
                  text: "11308 完整读取一行",
                  link: "/教程/题解/语法和标准库/13_输入输出/11409",
                },
                {
                  text: "11314 合并多个文件",
                  link: "/教程/题解/语法和标准库/13_输入输出/11314",
                },
                {
                  text: "11315 灰度字符画降噪",
                  link: "/教程/题解/语法和标准库/13_输入输出/11315",
                },
              ],
            },
            {
              text: "[115] 动态内存管理",
              collapsed: true,
              items: [
                {
                  text: "11101 环形缓冲区",
                  link: "/教程/题解/语法和标准库/11_动态存储与所有权/11101",
                },
                {
                  text: "11102 可增长字节缓冲区",
                  link: "/教程/题解/语法和标准库/11_动态存储与所有权/11102",
                },
                {
                  text: "11103 完整读取二进制流",
                  link: "/教程/题解/语法和标准库/11_动态存储与所有权/11103",
                },
              ],
            },
            {
              text: "[116] 字符字符串库",
              collapsed: true,
              items: [
                {
                  text: "10902 大小写转换",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11602",
                },
                {
                  text: "10904 烃的化学式",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11604",
                },
                {
                  text: "10903 英语全字母句",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11603",
                },
                {
                  text: "10905 游程编码",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11605",
                },
                {
                  text: "10906 字符串列表多视图排序",
                  link: "/教程/题解/语法和标准库/9_字符与字符串/11606",
                },
              ],
            },
            {
              text: "[117] 数学库",
              collapsed: true,
              items: [
                {
                  text: "11902 割圆术",
                  link: "/教程/题解/语法和标准库/19_数值_位运算与随机数/12002",
                },
                {
                  text: "11906 投飞镖估算 pi",
                  link: "/教程/题解/语法和标准库/19_数值_位运算与随机数/11906",
                },
                {
                  text: "11907 投针估算 pi",
                  link: "/教程/题解/语法和标准库/19_数值_位运算与随机数/11907",
                },
              ],
            },
            {
              text: "[118] 算法库",
              collapsed: true,
              items: [
                {
                  text: "11202 统计不同值",
                  link: "/教程/题解/语法和标准库/12_函数接口进阶/11202",
                },
              ],
            },
            {
              text: "[119] 时间日期库",
              collapsed: true,
              items: [
                {
                  text: "12004 十亿秒后的时刻",
                  link: "/教程/题解/语法和标准库/20_日期与时间/12004",
                },
              ],
            },
            {
              text: "[124] JSON parser",
              collapsed: true,
              items: [
                {
                  text: "22001 限制 JSON 嵌套深度",
                  link: "/教程/题解/开发与工程基础/20_JSON解析器工程化/22001",
                },
              ],
            },
          ],
        },
        {
          text: "[2] 开发与工程基础",
          collapsed: true,
          items: [
            {
              text: "暂无题解",
              link: "/教程/题解/快速导航",
            },
          ],
        },
        {
          text: "[3] 数据结构与算法",
          collapsed: false,
          items: [
            {
              text: "[300] 数据结构基础",
              collapsed: true,
              items: [
                {
                  text: "30001 不透明整数栈 ADT",
                  link: "/教程/题解/数据结构与算法/抽象数据类型/30001",
                },
                {
                  text: "30002 顺序表区间操作",
                  link: "/教程/题解/数据结构与算法/线性表/30002",
                },
                {
                  text: "30003 单链表所有权",
                  link: "/教程/题解/数据结构与算法/线性表/30003",
                },
                {
                  text: "30004 开放寻址字符串集合",
                  link: "/教程/题解/数据结构与算法/抽象数据类型/30004",
                },
                {
                  text: "30005 可替换的整数序列后端",
                  link: "/教程/题解/数据结构与算法/抽象数据类型/30005",
                },
              ],
            },
            {
              text: "[303] 时间和空间复杂度",
              collapsed: true,
              items: [
                {
                  text: "30301 函数增长速度",
                  link: "/教程/题解/数据结构与算法/时空复杂度/30301",
                },
                {
                  text: "30302 秦九韶算法复杂度",
                  link: "/教程/题解/数据结构与算法/时空复杂度/30302",
                },
              ],
            },
            {
              text: "[304] 查找与选择",
              collapsed: true,
              items: [
                {
                  text: "30401 二分下界",
                  link: "/教程/题解/数据结构与算法/查找与选择/30401",
                },
                {
                  text: "30402 最短生产时间",
                  link: "/教程/题解/数据结构与算法/查找与选择/30402",
                },
              ],
            },
            {
              text: "[305] 分治法和递归式",
              collapsed: true,
              items: [
                {
                  text: "30501 主定理解递归式",
                  link: "/教程/题解/数据结构与算法/分治法和递归式/30501",
                },
                {
                  text: "30511 约瑟夫环",
                  link: "/教程/题解/数据结构与算法/分治法和递归式/30511",
                },
              ],
            },
            {
              text: "[307] 贪心算法",
              collapsed: true,
              items: [
                {
                  text: "30701 最多可看电影",
                  link: "/教程/题解/数据结构与算法/贪心算法/30701",
                },
              ],
            },
            {
              text: "[308] 动态规划",
              collapsed: true,
              items: [
                {
                  text: "30803 编辑距离",
                  link: "/教程/题解/数据结构与算法/动态规划/30803",
                },
              ],
            },
          ],
        },
        {
          text: "[4] 系统编程",
          collapsed: true,
          items: [
            {
              text: "暂无题解",
              link: "/教程/题解/快速导航",
            },
          ],
        },
        {
          text: "[5] 项目案例",
          collapsed: true,
          items: [
            {
              text: "暂无题解",
              link: "/教程/题解/快速导航",
            },
          ],
        },
        {
          text: "[6] 嵌入式",
          collapsed: true,
          items: [
            {
              text: "暂无题解",
              link: "/教程/题解/快速导航",
            },
          ],
        },
      ],
    },
  ],
  "/教程/标准文档翻译": [
    {
      text: "目录",
      link: "/教程/标准文档翻译/目录.md",
    },
    {
      text: "术语索引",
      link: "/教程/标准文档翻译/术语索引.md",
    },
    {
      text: "1. 涵盖范围",
      link: "/教程/标准文档翻译/1_涵盖范围.md",
    },
    {
      text: "2. 规范性引用文件",
      link: "/教程/标准文档翻译/2_规范性引用文件.md",
    },
    {
      text: "3. 术语、定义和符号",
      link: "/教程/标准文档翻译/3_术语、定义和符号.md",
      collapsed: true,
      items: [
        {
          text: "3.1 总则与行为相关术语",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_1_总则与行为相关术语.md",
        },
        {
          text: "3.2 数据表示与程序构成相关术语",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_2_数据表示与程序构成相关术语.md",
        },
        {
          text: "3.3 值、表示与数学符号",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_3_值_表示与数学符号.md",
        },
      ],
    },
    {
      text: "4. 一致性",
      link: "/教程/标准文档翻译/4_一致性.md",
    },
    {
      text: "5. 环境",
      link: "/教程/标准文档翻译/5_环境.md",
      collapsed: true,
      items: [
        {
          text: "5.1 概念模型",
          link: "/教程/标准文档翻译/5_环境/5_1_概念模型.md",
        },
        {
          text: "5.1.1 翻译环境",
          link: "/教程/标准文档翻译/5_环境/5_1_1_翻译环境.md",
        },
        {
          text: "5.1.2 执行环境",
          link: "/教程/标准文档翻译/5_环境/5_1_2_执行环境.md",
        },
        {
          text: "5.2 环境考虑因素",
          link: "/教程/标准文档翻译/5_环境/5_2_环境考虑因素.md",
          collapsed: true,
          items: [
            {
              text: "5.2.1 字符集",
              link: "/教程/标准文档翻译/5_环境/5_2_1_字符集.md",
            },
            {
              text: "5.2.2 多字节字符",
              link: "/教程/标准文档翻译/5_环境/5_2_2_多字节字符.md",
            },
            {
              text: "5.2.3 字符显示语义",
              link: "/教程/标准文档翻译/5_环境/5_2_3_字符显示语义.md",
            },
            {
              text: "5.2.4 信号和中断",
              link: "/教程/标准文档翻译/5_环境/5_2_4_信号和中断.md",
            },
            {
              text: "5.2.5 环境限度",
              link: "/教程/标准文档翻译/5_环境/5_2_5_环境限度.md",
            },
          ],
        },
      ],
    },
    {
      text: "6. 语言",
      items: [
        {
          text: "6.1 注解",
          link: "/教程/标准文档翻译/6_语言/6_1_注解.md",
        },
        {
          text: "6.2 概念",
          link: "/教程/标准文档翻译/6_语言/6_2_概念.md",
          collapsed: true,
          items: [
            {
              text: "6.2.1 标识符、类型名和复合字面量的作用域",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_1_标识符_类型名和复合字面量的作用域.md",
            },
            {
              text: "6.2.2 标识符的链接",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_2_标识符的链接.md",
            },
            {
              text: "6.2.3 标识符的命名空间",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_3_标识符的命名空间.md",
            },
            {
              text: "6.2.4 对象的存储期",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_4_对象的存储期.md",
            },
            {
              text: "6.2.5 类型",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_5_类型.md",
            },
            {
              text: "6.2.6 类型的表示",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_6_类型的表示.md",
            },
            {
              text: "6.2.7 兼容类型和复合类型",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_7_兼容类型和复合类型.md",
            },
            {
              text: "6.2.8 对象的对齐",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_8_对象的对齐.md",
            },
            {
              text: "6.2.9 编码",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_9_编码.md",
            },
          ],
        },
        {
          text: "6.3 转换",
          link: "/教程/标准文档翻译/6_语言/6_3_转换.md",
          collapsed: true,
          items: [
            {
              text: "6.3.1 算术操作数",
              link: "/教程/标准文档翻译/6_语言/6_3_转换/6_3_1_算术操作数.md",
            },
            {
              text: "6.3.2 其他操作数",
              link: "/教程/标准文档翻译/6_语言/6_3_转换/6_3_2_其他操作数.md",
            },
          ],
        },
        {
          text: "6.4 词法元素",
          link: "/教程/标准文档翻译/6_语言/6_4_词法元素.md",
          collapsed: true,
          items: [
            {
              text: "6.4.1 关键字",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_1_关键字.md",
            },
            {
              text: "6.4.2 标识符",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_2_标识符.md",
            },
            {
              text: "6.4.3 通用字符名",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_3_通用字符名.md",
            },
            {
              text: "6.4.4 常量",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_4_常量.md",
            },
            {
              text: "6.4.5 字符串字面量",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_5_字符串字面量.md",
            },
            {
              text: "6.4.6 标点符号",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_6_标点符号.md",
            },
            {
              text: "6.4.7 头名称",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_7_头名称.md",
            },
            {
              text: "6.4.8 预处理数",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_8_预处理数.md",
            },
            {
              text: "6.4.9 注释",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_9_注释.md",
            },
          ],
        },
        {
          text: "6.5 表达式",
          link: "/教程/标准文档翻译/6_语言/6_5_表达式.md",
          collapsed: true,
          items: [
            {
              text: "6.5.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_1_一般规定.md",
            },
            {
              text: "6.5.2 基本表达式",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_2_基本表达式.md",
            },
            {
              text: "6.5.3 后缀运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_3_后缀运算符.md",
            },
            {
              text: "6.5.4 一元运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_4_一元运算符.md",
            },
            {
              text: "6.5.5 强制转换运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_5_强制转换运算符.md",
            },
            {
              text: "6.5.6 乘法运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_6_乘法运算符.md",
            },
            {
              text: "6.5.7 加法运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_7_加法运算符.md",
            },
            {
              text: "6.5.8 按位移位运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_8_按位移位运算符.md",
            },
            {
              text: "6.5.9 关系运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_9_关系运算符.md",
            },
            {
              text: "6.5.10 相等运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_10_相等运算符.md",
            },
            {
              text: "6.5.11 按位与运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_11_按位与运算符.md",
            },
            {
              text: "6.5.12 按位异或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_12_按位异或运算符.md",
            },
            {
              text: "6.5.13 按位或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_13_按位或运算符.md",
            },
            {
              text: "6.5.14 逻辑与运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_14_逻辑与运算符.md",
            },
            {
              text: "6.5.15 逻辑或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_15_逻辑或运算符.md",
            },
            {
              text: "6.5.16 条件运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_16_条件运算符.md",
            },
            {
              text: "6.5.17 赋值运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_17_赋值运算符.md",
            },
            {
              text: "6.5.18 逗号运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_18_逗号运算符.md",
            },
          ],
        },
        {
          text: "6.6 常量表达式",
          link: "/教程/标准文档翻译/6_语言/6_6_常量表达式.md",
        },
        {
          text: "6.7 声明",
          link: "/教程/标准文档翻译/6_语言/6_7_声明.md",
          collapsed: true,
          items: [
            {
              text: "6.7.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_1_一般规定.md",
            },
            {
              text: "6.7.2 存储类说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_2_存储类说明符.md",
            },
            {
              text: "6.7.3 类型说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_类型说明符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.3.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_1_一般规定.md",
                },
                {
                  text: "6.7.3.2 结构体和联合体说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_2_结构体和联合体说明符.md",
                },
                {
                  text: "6.7.3.3 枚举说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_3_枚举说明符.md",
                },
                {
                  text: "6.7.3.4 标记",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_4_标记.md",
                },
                {
                  text: "6.7.3.5 原子类型说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_5_原子类型说明符.md",
                },
                {
                  text: "6.7.3.6 typeof 说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_6_typeof_说明符.md",
                },
              ],
            },
            {
              text: "6.7.4 类型限定符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_类型限定符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.4.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_1_一般规定.md",
                },
                {
                  text: "6.7.4.2 restrict 的形式化定义",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_2_restrict_的形式化定义.md",
                },
              ],
            },
            {
              text: "6.7.5 函数说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_5_函数说明符.md",
            },
            {
              text: "6.7.6 对齐说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_6_对齐说明符.md",
            },
            {
              text: "6.7.7 声明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_声明符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.7.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_1_一般规定.md",
                },
                {
                  text: "6.7.7.2 指针声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_8_2_指针声明符.md",
                },
                {
                  text: "6.7.7.3 数组声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_3_数组声明符.md",
                },
                {
                  text: "6.7.7.4 函数声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_4_函数声明符.md",
                },
              ],
            },
            {
              text: "6.7.8 类型名",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_8_类型名.md",
            },
            {
              text: "6.7.9 类型定义",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_9_类型定义.md",
            },
            {
              text: "6.7.10 类型推导",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_10_类型推导.md",
            },
            {
              text: "6.7.11 初始化",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_11_初始化.md",
            },
            {
              text: "6.7.12 静态断言",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_12_静态断言.md",
            },
            {
              text: "6.7.13 属性",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_属性.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.13.1 引言",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_1_引言.md",
                },
                {
                  text: "6.7.13.2 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_2_一般规定.md",
                },
                {
                  text: "6.7.13.3 nodiscard 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_3_nodiscard_属性.md",
                },
                {
                  text: "6.7.13.4 maybe_unused 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_4_maybe_unused_属性.md",
                },
                {
                  text: "6.7.13.5 deprecated 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_5_deprecated_属性.md",
                },
                {
                  text: "6.7.13.6 fallthrough 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_6_fallthrough_属性.md",
                },
                {
                  text: "6.7.13.7 noreturn 与 _Noreturn 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_7_noreturn_与_Noreturn_属性.md",
                },
                {
                  text: "6.7.13.8 函数类型的标准属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_8_函数类型的标准属性.md",
                  collapsed: true,
                  items: [
                    {
                      text: "6.7.13.8.1 一般规定",
                      link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_8_1_一般规定.md",
                    },
                  ],
                },
              ],
            },
          ],
        },
        {
          text: "6.8 语句",
          link: "/教程/标准文档翻译/6_语言/6_8_语句.md",
          collapsed: true,
          items: [
            {
              text: "6.8.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_1_一般规定.md",
            },
            {
              text: "6.8.2 带标签语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_2_带标签语句.md",
            },
            {
              text: "6.8.3 复合语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_3_复合语句.md",
            },
            {
              text: "6.8.4 表达式语句和空语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_4_表达式语句和空语句.md",
            },
            {
              text: "6.8.5 选择语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.5.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_1_一般规定.md",
                },
                {
                  text: "6.8.5.2 if 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_2_if_语句.md",
                },
                {
                  text: "6.8.5.3 switch 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_3_switch_语句.md",
                },
              ],
            },
            {
              text: "6.8.6 迭代语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.6.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_1_一般规定.md",
                },
                {
                  text: "6.8.6.2 while 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_2_while_语句.md",
                },
                {
                  text: "6.8.6.3 do 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_3_do_语句.md",
                },
                {
                  text: "6.8.6.4 for 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_4_for_语句.md",
                },
              ],
            },
            {
              text: "6.8.7 跳转语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.7.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_1_一般规定.md",
                },
                {
                  text: "6.8.7.2 goto 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_2_goto_语句.md",
                },
                {
                  text: "6.8.7.3 continue 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_3_continue_语句.md",
                },
                {
                  text: "6.8.7.4 break 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_4_break_语句.md",
                },
                {
                  text: "6.8.7.5 return 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_5_return_语句.md",
                },
              ],
            },
          ],
        },
        {
          text: "6.9 外部定义",
          link: "/教程/标准文档翻译/6_语言/6_9_外部定义.md",
          collapsed: true,
          items: [
            {
              text: "6.9.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_1_一般规定.md",
            },
            {
              text: "6.9.2 函数定义",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_2_函数定义.md",
            },
            {
              text: "6.9.3 外部对象定义",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_3_外部对象定义.md",
            },
          ],
        },
        {
          text: "6.10 预处理指令",
          link: "/教程/标准文档翻译/6_语言/6_10_预处理指令.md",
          collapsed: true,
          items: [
            {
              text: "6.10.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_1_一般规定.md",
            },
            {
              text: "6.10.2 条件包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_2_条件包含.md",
            },
            {
              text: "6.10.3 源文件包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_3_源文件包含.md",
            },
            {
              text: "6.10.4 二进制资源包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.4.1 #embed 预处理指令",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含/6_10_4_1_embed_预处理指令.md",
                },
                {
                  text: "6.10.4.2 limit 参数",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含/6_10_4_2_limit_参数.md",
                },
              ],
            },
            {
              text: "6.10.5 宏替换",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.5.1 实参替换",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_1_实参替换.md",
                },
                {
                  text: "6.10.5.2 # 运算符",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_2_hash_运算符.md",
                },
                {
                  text: "6.10.5.3 ## 运算符",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_3_hashhash_运算符.md",
                },
                {
                  text: "6.10.5.4 重新扫描与进一步替换",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_4_重新扫描与进一步替换.md",
                },
                {
                  text: "6.10.5.5 宏定义的作用域",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_5_宏定义的作用域.md",
                },
              ],
            },
            {
              text: "6.10.6 行控制",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_6_行控制.md",
            },
            {
              text: "6.10.7 诊断指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_7_诊断指令.md",
            },
            {
              text: "6.10.8 pragma 指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_8_pragma_指令.md",
            },
            {
              text: "6.10.9 空指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_9_空指令.md",
            },
            {
              text: "6.10.10 预定义宏名",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.10.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_1_一般规定.md",
                },
                {
                  text: "6.10.10.2 强制宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_2_强制宏.md",
                },
                {
                  text: "6.10.10.3 环境宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_3_环境宏.md",
                },
                {
                  text: "6.10.10.4 条件特性宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_4_条件特性宏.md",
                },
              ],
            },
            {
              text: "6.10.11 pragma 运算符",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_11_pragma_运算符.md",
            },
          ],
        },
        {
          text: "6.11 未来语言方向",
          link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向.md",
          collapsed: true,
          items: [
            {
              text: "6.11.1 浮点类型",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_1_浮点类型.md",
            },
            {
              text: "6.11.2 标识符的链接",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_2_标识符的链接.md",
            },
            {
              text: "6.11.3 外部名称",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_3_外部名称.md",
            },
            {
              text: "6.11.4 字符转义序列",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_4_字符转义序列.md",
            },
            {
              text: "6.11.5 存储类说明符",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_5_存储类说明符.md",
            },
            {
              text: "6.11.6 pragma 指令",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_6_pragma_指令.md",
            },
            {
              text: "6.11.7 预定义宏名",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_7_预定义宏名.md",
            },
          ],
        },
      ],
      collapsed: false,
    },
    {
      text: "未定义行为列表",
      link: "/教程/标准文档翻译/c_ub_list.md",
    },
  ],
  "/教程/ModernC": [
    {
      text: "目录",
      link: "/教程/ModernC/目录",
    },
    {
      text: "前置内容",
      collapsed: true,
      items: [
        {
          text: "前言",
          link: "/教程/ModernC/前言",
        },
      ],
    },
    {
      text: "第 0 级：邂逅",
      collapsed: false,
      items: [
        {
          text: "邂逅",
          link: "/教程/ModernC/00_邂逅",
        },
        {
          text: "第 1 章：入门",
          link: "/教程/ModernC/01_入门",
        },
        {
          text: "第 2 章：程序的基本结构",
          link: "/教程/ModernC/02_程序的基本结构",
        },
      ],
    },
    {
      text: "第 1 级：相识",
      collapsed: false,
      items: [
        {
          text: "相识",
          link: "/教程/ModernC/Level1_相识",
        },
        {
          text: "第 3 章：一切都与控制有关",
          link: "/教程/ModernC/03_一切都与控制有关",
        },
        {
          text: "第 4 章：表达计算",
          link: "/教程/ModernC/04_表达计算",
        },
        {
          text: "第 5 章：基本值与数据",
          link: "/教程/ModernC/05_基本值与数据",
        },
        {
          text: "第 6 章：派生数据类型",
          link: "/教程/ModernC/06_派生数据类型",
        },
        {
          text: "第 7 章：函数",
          link: "/教程/ModernC/07_函数",
        },
        {
          text: "第 8 章：C 库函数",
          link: "/教程/ModernC/08_C库函数",
        },
      ],
    },
    {
      text: "第 2 级：相知",
      collapsed: true,
      items: [
        {
          text: "第 9 章：风格",
          link: "/教程/ModernC/09_风格",
        },
        {
          text: "第 10 章：组织与文档",
          link: "/教程/ModernC/10_组织与文档",
        },
        {
          text: "第 11 章：指针",
          link: "/教程/ModernC/11_指针",
        },
        {
          text: "第 12 章：C 内存模型",
          link: "/教程/ModernC/12_C内存模型",
        },
        {
          text: "第 13 章：存储",
          link: "/教程/ModernC/13_存储",
        },
        {
          text: "第 14 章：进阶处理与输入输出",
          link: "/教程/ModernC/14_进阶处理与输入输出",
        },
        {
          text: "第 15 章：程序故障",
          link: "/教程/ModernC/15_程序故障",
        },
      ],
    },
    {
      text: "第 3 级：深入",
      collapsed: true,
      items: [
        {
          text: "第 16 章：性能",
          link: "/教程/ModernC/16_性能",
        },
        {
          text: "第 17 章：类函数宏",
          link: "/教程/ModernC/17_类函数宏",
        },
        {
          text: "第 18 章：类型泛型编程",
          link: "/教程/ModernC/18_类型泛型编程",
        },
        {
          text: "第 19 章：控制流的变化",
          link: "/教程/ModernC/19_控制流的变化",
        },
        {
          text: "第 20 章：线程",
          link: "/教程/ModernC/20_线程",
        },
        {
          text: "第 21 章：原子访问与内存一致性",
          link: "/教程/ModernC/21_原子访问与内存一致性",
        },
      ],
    },
    {
      text: "附录",
      collapsed: true,
      items: [
        {
          text: "技术附录",
          link: "/教程/ModernC/技术附录",
        },
        {
          text: "要点汇总",
          link: "/教程/ModernC/要点汇总",
        },
        {
          text: "参考文献",
          link: "/教程/ModernC/参考文献",
        },
        {
          text: "索引",
          link: "/教程/ModernC/索引",
        },
      ],
    },
  ],
};
