import { type DefaultTheme } from "vitepress";
export const Nav: DefaultTheme.NavItem[] = [
  {
    text: "Home",
    link: "/",
  },
  {
    text: "总纲",
    link: "/教程/正文/总纲",
  },
  {
    text: "关于",
    link: "/About",
  },
  {
    text: "组件展示",
    link: "/杂项/组件展示",
  },
];
export const Sidebar: DefaultTheme.Sidebar = {
  "/教程/正文/": [
    {
      text: "教程目录",
      items: [
        {
          text: "总纲",
          link: "/教程/正文/总纲",
        },
        {
          text: "语法和标准库",
          collapsed: false,
          items: [
            {
              text: "1. 在开始编程之前",
              link: "/教程/正文/语法和标准库/1_在开始编程之前",
            },
            {
              text: "2. 一个简单的 C 程序",
              link: "/教程/正文/语法和标准库/2_一个简单的C程序",
              collapsed: true,
              items: [
                {
                  text: "2.1 CLion",
                  link: "/教程/正文/语法和标准库/2_一个简单的C程序/2_1_CLion",
                },
                {
                  text: "2.2 Lightly",
                  link: "/教程/正文/语法和标准库/2_一个简单的C程序/2_2_Lightly",
                },
              ],
            },
            {
              text: "3. 基本概念",
              link: "/教程/正文/语法和标准库/3_基本概念",
              collapsed: true,
              items: [
                {
                  text: "3.1 注释",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_1_注释",
                },
                {
                  text: "3.2 对象",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_2_对象",
                  collapsed: false,
                  items: [
                    {
                      text: "3.2.1 类型",
                      link: "/教程/正文/语法和标准库/3_基本概念/3_2_对象/3_2_1_类型",
                    },
                    {
                      text: "3.2.2 声明和初始化",
                      link: "/教程/正文/语法和标准库/3_基本概念/3_2_对象/3_2_2_声明和初始化",
                    },
                  ],
                },
                {
                  text: "3.3 标识符",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_3_标识符",
                  collapsed: false,
                  items: [
                    {
                      text: "3.3.1 保留标识符",
                      link: "/教程/正文/语法和标准库/3_基本概念/3_3_标识符/3_3_1_保留标识符",
                    },
                    {
                      text: "3.3.2 作用域",
                      link: "/教程/正文/语法和标准库/3_基本概念/3_3_标识符/3_3_2_作用域",
                    },
                  ],
                },
                {
                  text: "3.4 翻译单元",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_4_翻译单元",
                },
                {
                  text: "3.5 翻译阶段",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_5_翻译阶段",
                },
                {
                  text: "3.6 遵从性和行为",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_6_遵从性和行为",
                },
                {
                  text: "3.7 ASCII 码",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_7_ASCII码",
                },
                {
                  text: "3.8 环境",
                  link: "/教程/正文/语法和标准库/3_基本概念/3_8_环境",
                },
              ],
            },
            {
              text: "4. 表达式",
              link: "/教程/正文/语法和标准库/4_表达式",
              collapsed: true,
              items: [
                {
                  text: "4.1 常量和字面量",
                  link: "/教程/正文/语法和标准库/4_表达式/4_1_常量和字面量",
                  collapsed: false,
                  items: [
                    {
                      text: "4.1.1 true false",
                      link: "/教程/正文/语法和标准库/4_表达式/4_1_常量和字面量/4_1_1_true_false",
                    },
                    {
                      text: "4.1.2 整数常量 浮点常量 字符常量",
                      link: "/教程/正文/语法和标准库/4_表达式/4_1_常量和字面量/4_1_2_整数常量_浮点常量_字符常量",
                    },
                    {
                      text: "4.1.3 字符串字面量",
                      link: "/教程/正文/语法和标准库/4_表达式/4_1_常量和字面量/4_1_3_字符串字面量",
                    },
                  ],
                },
                {
                  text: "4.2 运算符",
                  link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符",
                  collapsed: false,
                  items: [
                    {
                      text: "4.2.1 算术运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_1_算术运算符",
                    },
                    {
                      text: "4.2.2 逻辑运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_2_逻辑运算符",
                    },
                    {
                      text: "4.2.3 赋值运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_3_赋值运算符",
                    },
                    {
                      text: "4.2.4 关系运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_4_关系运算符",
                    },
                    {
                      text: "4.2.5 三元运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_5_三元运算符",
                    },
                    {
                      text: "4.2.6 类型转换运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_6_类型转换运算符",
                    },
                    {
                      text: "4.2.7 逗号运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_7_逗号运算符",
                    },
                    {
                      text: "4.2.8 sizeof",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_8_sizeof",
                    },
                    {
                      text: "4.2.9 其他运算符",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_9_其他运算符",
                    },
                    {
                      text: "4.2.10 优先级 结合性",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_10_优先级_结合性",
                    },
                    {
                      text: "4.2.11 运算符宏",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_11_运算符宏",
                    },
                    {
                      text: "4.2.12 代用记号",
                      link: "/教程/正文/语法和标准库/4_表达式/4_2_运算符/4_2_12_代用记号",
                    },
                  ],
                },
                {
                  text: "4.3 求值",
                  link: "/教程/正文/语法和标准库/4_表达式/4_3_求值",
                  collapsed: false,
                  items: [
                    {
                      text: "4.3.1 求值和副作用",
                      link: "/教程/正文/语法和标准库/4_表达式/4_3_求值/4_3_1_求值和副作用",
                    },
                    {
                      text: "4.3.2 求值顺序",
                      link: "/教程/正文/语法和标准库/4_表达式/4_3_求值/4_3_2_求值顺序",
                    },
                  ],
                },
                {
                  text: "4.4 泛型选择",
                  link: "/教程/正文/语法和标准库/4_表达式/4_4_泛型选择",
                },
              ],
            },
            {
              text: "5. 语句",
              link: "/教程/正文/语法和标准库/5_语句",
              collapsed: true,
              items: [
                {
                  text: "5.1 表达式语句",
                  link: "/教程/正文/语法和标准库/5_语句/5_1_表达式语句",
                },
                {
                  text: "5.2 复合语句",
                  link: "/教程/正文/语法和标准库/5_语句/5_2_复合语句",
                },
                {
                  text: "5.3 选择语句",
                  link: "/教程/正文/语法和标准库/5_语句/5_3_选择语句",
                  collapsed: false,
                  items: [
                    {
                      text: "5.3.1 if else",
                      link: "/教程/正文/语法和标准库/5_语句/5_3_选择语句/5_3_1_if_else",
                    },
                    {
                      text: "5.3.2 switch",
                      link: "/教程/正文/语法和标准库/5_语句/5_3_选择语句/5_3_2_switch",
                    },
                  ],
                },
                {
                  text: "5.4 循环语句",
                  link: "/教程/正文/语法和标准库/5_语句/5_4_循环语句",
                  collapsed: false,
                  items: [
                    {
                      text: "5.4.1 while",
                      link: "/教程/正文/语法和标准库/5_语句/5_4_循环语句/5_4_1_while",
                    },
                    {
                      text: "5.4.2 do while",
                      link: "/教程/正文/语法和标准库/5_语句/5_4_循环语句/5_4_2_do_while",
                    },
                    {
                      text: "5.4.3 for",
                      link: "/教程/正文/语法和标准库/5_语句/5_4_循环语句/5_4_3_for",
                    },
                  ],
                },
                {
                  text: "5.5 跳转语句",
                  link: "/教程/正文/语法和标准库/5_语句/5_5_跳转语句",
                  collapsed: false,
                  items: [
                    {
                      text: "5.5.1 break continue",
                      link: "/教程/正文/语法和标准库/5_语句/5_5_跳转语句/5_5_1_break_continue",
                    },
                    {
                      text: "5.5.2 return",
                      link: "/教程/正文/语法和标准库/5_语句/5_5_跳转语句/5_5_2_return",
                    },
                    {
                      text: "5.5.3 goto",
                      link: "/教程/正文/语法和标准库/5_语句/5_5_跳转语句/5_5_3_goto",
                    },
                  ],
                },
              ],
            },
            {
              text: "6. 枚举",
              link: "/教程/正文/语法和标准库/6_枚举",
            },
            {
              text: "7. 函数",
              link: "/教程/正文/语法和标准库/7_函数",
              collapsed: true,
              items: [
                {
                  text: "7.1 函数声明",
                  link: "/教程/正文/语法和标准库/7_函数/7_1_函数声明",
                },
                {
                  text: "7.2 可变参数",
                  link: "/教程/正文/语法和标准库/7_函数/7_2_可变参数",
                },
              ],
            },
            {
              text: "8. 派生类型",
              link: "/教程/正文/语法和标准库/8_派生类型",
              collapsed: true,
              items: [
                {
                  text: "8.1 数组",
                  link: "/教程/正文/语法和标准库/8_派生类型/8_1_数组",
                },
                {
                  text: "8.2 指针",
                  link: "/教程/正文/语法和标准库/8_派生类型/8_2_指针",
                },
                {
                  text: "8.3 结构体",
                  link: "/教程/正文/语法和标准库/8_派生类型/8_3_结构体",
                },
                {
                  text: "8.4 联合体",
                  link: "/教程/正文/语法和标准库/8_派生类型/8_4_联合体",
                },
              ],
            },
            {
              text: "9. 对象模型",
              link: "/教程/正文/语法和标准库/9_对象模型",
              collapsed: true,
              items: [
                {
                  text: "9.1 内存模型",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_1_内存模型",
                },
                {
                  text: "9.2 对象表示",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_2_对象表示",
                  collapsed: false,
                  items: [
                    {
                      text: "9.2.1 对齐",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_2_对象表示/9_2_1_对齐",
                    },
                    {
                      text: "9.2.2 alignof",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_2_对象表示/9_2_2_alignof",
                    },
                  ],
                },
                {
                  text: "9.3 生存期",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_3_生存期",
                },
                {
                  text: "9.4 声明",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明",
                  collapsed: false,
                  items: [
                    {
                      text: "9.4.1 typeof",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_1_typeof",
                    },
                    {
                      text: "9.4.2 constexpr",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_2_constexpr",
                    },
                    {
                      text: "9.4.3 const volatile",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_3_const_volatile",
                    },
                    {
                      text: "9.4.4 restrict",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_4_restrict",
                    },
                    {
                      text: "9.4.5 alignas",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_5_alignas",
                    },
                    {
                      text: "9.4.6 static_assert",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_6_static_assert",
                    },
                    {
                      text: "9.4.7 存储期 链接",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_7_存储期_链接",
                    },
                    {
                      text: "9.4.8 定义",
                      link: "/教程/正文/语法和标准库/9_对象模型/9_4_声明/9_4_8_定义",
                    },
                  ],
                },
                {
                  text: "9.5 typedef",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_5_typedef",
                },
                {
                  text: "9.6 属性",
                  link: "/教程/正文/语法和标准库/9_对象模型/9_6_属性",
                },
              ],
            },
            {
              text: "10. 预处理器",
              link: "/教程/正文/语法和标准库/10_预处理器",
              collapsed: true,
              items: [
                {
                  text: "10.1 define",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_1_define",
                },
                {
                  text: "10.2 include",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_2_include",
                },
                {
                  text: "10.3 if n def",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_3_if_n_def",
                },
                {
                  text: "10.4 error warning",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_4_error_warning",
                },
                {
                  text: "10.5 embed",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_5_embed",
                },
                {
                  text: "10.6 pragma",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_6_pragma",
                },
                {
                  text: "10.7 line",
                  link: "/教程/正文/语法和标准库/10_预处理器/10_7_line",
                },
              ],
            },
            {
              text: "11. 标准库概述",
              link: "/教程/正文/语法和标准库/11_标准库概述",
            },
            {
              text: "12. 标准库中的宏",
              link: "/教程/正文/语法和标准库/12_标准库中的宏",
              collapsed: true,
              items: [
                {
                  text: "12.1 &lt;stddef.h&gt;",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_1_stddef",
                },
                {
                  text: "12.2 &lt;stdint.h&gt;",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_2_stdint",
                },
                {
                  text: "12.3 &lt;inttypes.h&gt;",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_3_inttypes",
                },
                {
                  text: "12.4 &lt;limits.h&gt;",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_4_limits",
                },
                {
                  text: "12.5 &lt;float.h&gt;",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_5_float",
                },
                {
                  text: "12.6 功能特性测试宏",
                  link: "/教程/正文/语法和标准库/12_标准库中的宏/12_6_功能特性测试宏",
                },
              ],
            },
            {
              text: "13. 错误处理",
              link: "/教程/正文/语法和标准库/13_错误处理",
              collapsed: true,
              items: [
                {
                  text: "13.1 &lt;assert.h&gt;",
                  link: "/教程/正文/语法和标准库/13_错误处理/13_1_assert",
                },
                {
                  text: "13.2 &lt;errno.h&gt;",
                  link: "/教程/正文/语法和标准库/13_错误处理/13_2_errno",
                },
                {
                  text: "13.3 &lt;signal.h&gt;",
                  link: "/教程/正文/语法和标准库/13_错误处理/13_3_signal",
                },
              ],
            },
            {
              text: "14. 程序支持",
              link: "/教程/正文/语法和标准库/14_程序支持",
              collapsed: true,
              items: [
                {
                  text: "14.1 终止程序",
                  link: "/教程/正文/语法和标准库/14_程序支持/14_1_终止程序",
                },
                {
                  text: "14.2 环境访问",
                  link: "/教程/正文/语法和标准库/14_程序支持/14_2_环境访问",
                },
                {
                  text: "14.3 跳转",
                  link: "/教程/正文/语法和标准库/14_程序支持/14_3_跳转",
                },
              ],
            },
            {
              text: "15. 输入输出",
              link: "/教程/正文/语法和标准库/15_输入输出",
              collapsed: true,
              items: [
                {
                  text: "15.1 IO 流",
                  link: "/教程/正文/语法和标准库/15_输入输出/15_1_IO流",
                },
                {
                  text: "15.2 文件操作",
                  link: "/教程/正文/语法和标准库/15_输入输出/15_2_文件操作",
                },
                {
                  text: "15.3 无格式/有格式输入输出",
                  link: "/教程/正文/语法和标准库/15_输入输出/15_3_无格式有格式输入输出",
                },
                {
                  text: "15.4 文件定位",
                  link: "/教程/正文/语法和标准库/15_输入输出/15_4_文件定位",
                },
                {
                  text: "15.5 其他文件操作",
                  link: "/教程/正文/语法和标准库/15_输入输出/15_5_其他文件操作",
                },
              ],
            },
            {
              text: "16. 动态内存管理",
              link: "/教程/正文/语法和标准库/16_动态内存管理",
            },
            {
              text: "17. 字符/字符串库",
              link: "/教程/正文/语法和标准库/17_字符_字符串库",
              collapsed: true,
              items: [
                {
                  text: "17.1 &lt;ctype.h&gt;",
                  link: "/教程/正文/语法和标准库/17_字符字符串库/17_1_ctype",
                },
                {
                  text: "17.2 &lt;string.h&gt;",
                  link: "/教程/正文/语法和标准库/17_字符字符串库/17_2_string",
                },
              ],
            },
            {
              text: "18. 数学库",
              link: "/教程/正文/语法和标准库/18_数学库",
              collapsed: true,
              items: [
                {
                  text: "18.1 &lt;math.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_1_math",
                },
                {
                  text: "18.2 &lt;complex.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_2_complex",
                },
                {
                  text: "18.3 &lt;tgmath.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_3_tgmath",
                },
                {
                  text: "18.4 随机数生成",
                  link: "/教程/正文/语法和标准库/18_数学库/18_4_随机数生成",
                },
                {
                  text: "18.5 &lt;stdbit.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_5_stdbit",
                },
                {
                  text: "18.6 &lt;stdckdint.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_6_stdckdint",
                },
                {
                  text: "18.7 &lt;fenv.h&gt;",
                  link: "/教程/正文/语法和标准库/18_数学库/18_7_fenv",
                },
              ],
            },
            {
              text: "19. 算法库",
              link: "/教程/正文/语法和标准库/19_算法库",
            },
            {
              text: "20. 时间日期库",
              link: "/教程/正文/语法和标准库/20_时间日期库",
            },
            {
              text: "21. 本地化库",
              link: "/教程/正文/语法和标准库/21_本地化库",
            },
            {
              text: "22. 并发支持",
              link: "/教程/正文/语法和标准库/22_并发支持",
              collapsed: true,
              items: [
                {
                  text: "22.1 线程",
                  link: "/教程/正文/语法和标准库/22_并发支持/22_1_线程",
                },
                {
                  text: "22.2 原子操作",
                  link: "/教程/正文/语法和标准库/22_并发支持/22_2_原子操作",
                },
                {
                  text: "22.3 互斥",
                  link: "/教程/正文/语法和标准库/22_并发支持/22_3_互斥",
                },
                {
                  text: "22.4 条件变量",
                  link: "/教程/正文/语法和标准库/22_并发支持/22_4_条件变量",
                },
                {
                  text: "22.5 线程局部存储",
                  link: "/教程/正文/语法和标准库/22_并发支持/22_5_线程局部存储",
                },
              ],
            },
            {
              text: "23. 标准库扩展",
              link: "/教程/正文/语法和标准库/23_标准库扩展",
            },
            {
              text: "24. 应用：JSON parser",
              link: "/教程/正文/语法和标准库/24_应用_JSON_parser",
            },
          ],
        },
        {
          text: "数据结构与算法",
          collapsed: false,
          items: [
            {
              text: "引言",
              link: "/教程/正文/数据结构与算法/1_在开始数据结构与算法之前",
            },
            {
              text: "数据结构",
              collapsed: true,
              items: [
                {
                  text: "1. ADT",
                  link: "/教程/正文/数据结构与算法/数据结构/1_ADT",
                },
                {
                  text: "2. 线性表",
                  link: "/教程/正文/数据结构与算法/数据结构/2_线性表",
                },
              ],
            },
            {
              text: "算法",
              collapsed: true,
              items: [
                {
                  text: "1. 什么是算法",
                  link: "/教程/正文/数据结构与算法/算法/1_什么是算法",
                },
                {
                  text: "2. 分析算法",
                  link: "/教程/正文/数据结构与算法/算法/2_分析算法",
                },
                {
                  text: "3. 算法的时间和空间复杂度",
                  link: "/教程/正文/数据结构与算法/算法/3_算法的时间和空间复杂度",
                },
                {
                  text: "4. 分治法和递归式",
                  link: "/教程/正文/数据结构与算法/算法/4_分治法和递归式",
                },
                {
                  text: "5. 排序算法",
                  link: "/教程/正文/数据结构与算法/算法/5_排序算法",
                },
              ],
            },
          ],
        },
        {
          text: "项目",
          collapsed: false,
          items: [
            {
              text: "项目结构",
              link: "/教程/正文/项目/1_项目结构",
            },
            {
              text: "Mdr Server",
              link: "/教程/正文/项目/Mdr_Server/项目概述",
              collapsed: true,
              items: [],
            },
            {
              text: "Mdr Chat Room",
              link: "/教程/正文/项目/Mdr_Chat_Room/项目概述",
              collapsed: true,
              items: [],
            },
            {
              text: "Mdr Lang",
              link: "/教程/正文/项目/Mdr_Lang/项目概述",
              collapsed: true,
              items: [],
            },
            {
              text: "MdrDB",
              link: "/教程/正文/项目/MdrDB/项目概述",
              collapsed: true,
              items: [],
            },
            {
              text: "MdrOS",
              link: "/教程/正文/项目/MdrOS/项目概述",
              collapsed: true,
              items: [
                {
                  text: "项目构建",
                  link: "/教程/正文/项目/MdrOS/build",
                },
                {
                  text: "引导程序",
                  link: "/教程/正文/项目/MdrOS/bootloader",
                },
                {
                  text: "视频驱动",
                  link: "/教程/正文/项目/MdrOS/video_driver",
                },
                {
                  text: "中断系统",
                  link: "/教程/正文/项目/MdrOS/interrupt",
                },
                {
                  text: "内存管理",
                  link: "/教程/正文/项目/MdrOS/memory",
                },
                {
                  text: "文件系统",
                  link: "/教程/正文/项目/MdrOS/filesystem",
                },
                {
                  text: "多任务",
                  link: "/教程/正文/项目/MdrOS/task",
                },
                {
                  text: "番外",
                  collapsed: true,
                  items: [
                    {
                      text: "ACPI",
                      link: "/教程/正文/项目/MdrOS/acpi",
                    },
                    {
                      text: "PCI",
                      link: "/教程/正文/项目/MdrOS/pci",
                    },
                    {
                      text: "OSDEV 代码矫正",
                      link: "/教程/正文/项目/MdrOS/osdev",
                    },
                    {
                      text: "疑难性解答",
                      link: "/教程/正文/项目/MdrOS/faq",
                    },
                  ],
                },
              ],
            },
            {
              text: "MdrHAL",
              collapsed: true,
              items: [],
            },
          ],
        },
        {
          text: "嵌入式",
          link: "/教程/正文/嵌入式/引言",
          collapsed: true,
          items: [
            {
              text: "环境搭建",
              link: "/教程/正文/嵌入式/环境搭建",
            },
            {
              text: "程序下载与调试",
              link: "/教程/正文/嵌入式/程序下载与调试",
            },
            {
              text: "初识 STM32",
              link: "/教程/正文/嵌入式/初识STM32",
            },
            {
              text: "寄存器编程",
              link: "/教程/正文/嵌入式/寄存器编程",
            },
            {
              text: "自己写库——构建库函数雏形",
              link: "/教程/正文/嵌入式/库函数雏形",
            },
            {
              text: "初识 HAL 库",
              link: "/教程/正文/嵌入式/初识HAL库",
            },
            {
              text: "操作 GPIO",
              link: "/教程/正文/嵌入式/操作GPIO",
            },
            {
              text: "RCC——使用时钟",
              link: "/教程/正文/嵌入式/操作时钟",
            },
            {
              text: "术语表",
              link: "/教程/正文/嵌入式/术语表",
            },
          ],
        },
      ],
    },
  ],
  "/教程/番外": [
    {
      text: "番外目录",
    },
  ],
  "/杂项": [
    {
      text: "杂项目录",
      items: [
        {
          text: "梦猫外传",
          collapsed: true,
          items: [
            {
              text: "-2. 梦开始的前兆",
              link: "/杂项/梦猫外传/-2_梦开始的前兆",
            },
          ],
        },
        {
          text: "给“纸质书”写的引言",
          link: "/杂项/分享/20241027",
        },
        {
          text: "VSCode 扩展",
          link: "/杂项/插件",
        },
        {
          text: "前端开发指南",
          link: "/杂项/前端",
        },
        {
          text: "组件展示",
          link: "/杂项/组件展示",
        },
      ],
    },
  ],
  "/教程/题解": [
    {
      text: "习题答案及解析",
      items: [
        {
          text: "快速导航",
          link: "/教程/题解/快速导航",
        },
        {
          text: "[1] 语法和标准库",
          collapsed: false,
          items: [
            {
              text: "[101] 在开始编程之前",
              collapsed: true,
              items: [
                {
                  text: "10101 使用搜索引擎",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10101",
                },
                {
                  text: "10102 熟悉键盘",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10102",
                },
                {
                  text: "10103 学会提问",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10103",
                },
                {
                  text: "10105 C++ Reference",
                  link: "/教程/题解/语法和标准库/在开始编程之前/10105",
                },
              ],
            },
            {
              text: "[102] 一个简单的 C 程序",
              collapsed: true,
              items: [
                {
                  text: "10201 编译运行示例",
                  link: "/教程/题解/语法和标准库/一个简单的C程序/10201",
                },
                {
                  text: "10202 修改输出内容",
                  link: "/教程/题解/语法和标准库/一个简单的C程序/10202",
                },
                {
                  text: "10203 整数除法",
                  link: "/教程/题解/语法和标准库/一个简单的C程序/10203",
                },
                {
                  text: "10204 触发断言",
                  link: "/教程/题解/语法和标准库/一个简单的C程序/10204",
                },
                {
                  text: "10205 理解 include",
                  link: "/教程/题解/语法和标准库/一个简单的C程序/10205",
                },
              ],
            },
            {
              text: "[104] 表达式",
              collapsed: true,
              items: [
                {
                  text: "10407 抽屉原理",
                  link: "/教程/题解/语法和标准库/表达式/10407",
                },
                {
                  text: "10408 小公式",
                  link: "/教程/题解/语法和标准库/表达式/10408",
                },
                {
                  text: "10409 2 的幂",
                  link: "/教程/题解/语法和标准库/表达式/10409",
                },
              ],
            },
            {
              text: "[105] 语句",
              collapsed: true,
              items: [
                {
                  text: "10502 输出字符串",
                  link: "/教程/题解/语法和标准库/语句/10502",
                },
                {
                  text: "10503 倒数平方和",
                  link: "/教程/题解/语法和标准库/语句/10503",
                },
                {
                  text: "10504 进制转换器",
                  link: "/教程/题解/语法和标准库/语句/10504",
                },
                {
                  text: "10505 乘二加一",
                  link: "/教程/题解/语法和标准库/语句/10505",
                },
                {
                  text: "10506 斐波那契数列",
                  link: "/教程/题解/语法和标准库/语句/10506",
                },
              ],
            },
            {
              text: "[106] 函数",
              collapsed: true,
              items: [
                {
                  text: "10601 填充字符",
                  link: "/教程/题解/语法和标准库/函数/10601",
                },
                {
                  text: "10602 自增自减函数",
                  link: "/教程/题解/语法和标准库/函数/10602",
                },
              ],
            },
            {
              text: "[107] 派生类型",
              collapsed: true,
              items: [
                {
                  text: "10701 矩阵加法",
                  link: "/教程/题解/语法和标准库/派生类型/数组/10701",
                },
                {
                  text: "10702 割圆术",
                  link: "/教程/题解/语法和标准库/派生类型/数组/10702",
                },
                {
                  text: "10703 生命游戏",
                  link: "/教程/题解/语法和标准库/派生类型/数组/10703",
                },
                {
                  text: "10704 阶乘",
                  link: "/教程/题解/语法和标准库/派生类型/数组/10704",
                },
                {
                  text: "10705 向量夹角",
                  link: "/教程/题解/语法和标准库/派生类型/数组/10705",
                },
                {
                  text: "10706 复数结构体",
                  link: "/教程/题解/语法和标准库/派生类型/结构体/10706",
                },
                {
                  text: "10707 分数结构体",
                  link: "/教程/题解/语法和标准库/派生类型/结构体/10707",
                },
                {
                  text: "10709 RGB 与 HSV",
                  link: "/教程/题解/语法和标准库/派生类型/结构体/10709",
                },
                {
                  text: "10710 联合体类型转换器",
                  link: "/教程/题解/语法和标准库/派生类型/联合体/10710",
                },
                {
                  text: "10713 联合体内存布局",
                  link: "/教程/题解/语法和标准库/派生类型/联合体/10713",
                },
              ],
            },
            {
              text: "[109] 对象",
              collapsed: true,
              items: [
                {
                  text: "10901 基本概念辨析",
                  link: "/教程/题解/语法和标准库/对象/10901",
                },
                {
                  text: "10902 未初始化对象",
                  link: "/教程/题解/语法和标准库/对象/10902",
                },
                {
                  text: "10903 抽象机器",
                  link: "/教程/题解/语法和标准库/对象/10903",
                },
              ],
            },
            {
              text: "[113] 错误处理",
              collapsed: true,
              items: [
                {
                  text: "11301 assert 与 errno",
                  link: "/教程/题解/语法和标准库/错误处理/11301",
                },
                {
                  text: "11302 parse_u32",
                  link: "/教程/题解/语法和标准库/错误处理/11302",
                },
                {
                  text: "11303 SIGINT 退出",
                  link: "/教程/题解/语法和标准库/错误处理/11303",
                },
              ],
            },
            {
              text: "[116] 字符字符串库",
              collapsed: true,
              items: [
                {
                  text: "11601 大小写转换",
                  link: "/教程/题解/语法和标准库/字符字符串库/11601",
                },
                {
                  text: "11602 烃的化学式",
                  link: "/教程/题解/语法和标准库/字符字符串库/11602",
                },
              ],
            },
            {
              text: "[117] 数学库",
              collapsed: true,
              items: [
                {
                  text: "11702 割圆术",
                  link: "/教程/题解/语法和标准库/数学库/11702",
                },
                {
                  text: "11706 投飞镖估算 pi",
                  link: "/教程/题解/语法和标准库/数学库/11706",
                },
                {
                  text: "11707 投针估算 pi",
                  link: "/教程/题解/语法和标准库/数学库/11707",
                },
              ],
            },
          ],
        },
      ],
    },
  ],
  "/教程/标准文档翻译": [
    {
      text: "目录",
      link: "/教程/标准文档翻译/目录.md",
    },
    {
      text: "术语索引",
      link: "/教程/标准文档翻译/术语索引.md",
    },
    {
      text: "1. 涵盖范围",
      link: "/教程/标准文档翻译/1_涵盖范围.md",
    },
    {
      text: "2. 规范性引用文件",
      link: "/教程/标准文档翻译/2_规范性引用文件.md",
    },
    {
      text: "3. 术语、定义和符号",
      link: "/教程/标准文档翻译/3_术语、定义和符号.md",
      collapsed: true,
      items: [
        {
          text: "3.1 总则与行为相关术语",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_1_总则与行为相关术语.md",
        },
        {
          text: "3.2 数据表示与程序构成相关术语",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_2_数据表示与程序构成相关术语.md",
        },
        {
          text: "3.3 值、表示与数学符号",
          link: "/教程/标准文档翻译/3_术语、定义和符号/3_3_值_表示与数学符号.md",
        },
      ],
    },
    {
      text: "4. 一致性",
      link: "/教程/标准文档翻译/4_一致性.md",
    },
    {
      text: "5. 环境",
      link: "/教程/标准文档翻译/5_环境.md",
      collapsed: true,
      items: [
        {
          text: "5.1 概念模型",
          link: "/教程/标准文档翻译/5_环境/5_1_概念模型.md",
        },
        {
          text: "5.1.1 翻译环境",
          link: "/教程/标准文档翻译/5_环境/5_1_1_翻译环境.md",
        },
        {
          text: "5.1.2 执行环境",
          link: "/教程/标准文档翻译/5_环境/5_1_2_执行环境.md",
        },
        {
          text: "5.2 环境考虑因素",
          link: "/教程/标准文档翻译/5_环境/5_2_环境考虑因素.md",
          collapsed: true,
          items: [
            {
              text: "5.2.1 字符集",
              link: "/教程/标准文档翻译/5_环境/5_2_1_字符集.md",
            },
            {
              text: "5.2.2 多字节字符",
              link: "/教程/标准文档翻译/5_环境/5_2_2_多字节字符.md",
            },
            {
              text: "5.2.3 字符显示语义",
              link: "/教程/标准文档翻译/5_环境/5_2_3_字符显示语义.md",
            },
            {
              text: "5.2.4 信号和中断",
              link: "/教程/标准文档翻译/5_环境/5_2_4_信号和中断.md",
            },
            {
              text: "5.2.5 环境限度",
              link: "/教程/标准文档翻译/5_环境/5_2_5_环境限度.md",
            },
          ],
        },
      ],
    },
    {
      text: "6. 语言",
      items: [
        {
          text: "6.1 注解",
          link: "/教程/标准文档翻译/6_语言/6_1_注解.md",
        },
        {
          text: "6.2 概念",
          link: "/教程/标准文档翻译/6_语言/6_2_概念.md",
          collapsed: true,
          items: [
            {
              text: "6.2.1 标识符、类型名和复合字面量的作用域",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_1_标识符_类型名和复合字面量的作用域.md",
            },
            {
              text: "6.2.2 标识符的链接",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_2_标识符的链接.md",
            },
            {
              text: "6.2.3 标识符的命名空间",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_3_标识符的命名空间.md",
            },
            {
              text: "6.2.4 对象的存储期",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_4_对象的存储期.md",
            },
            {
              text: "6.2.5 类型",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_5_类型.md",
            },
            {
              text: "6.2.6 类型的表示",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_6_类型的表示.md",
            },
            {
              text: "6.2.7 兼容类型和复合类型",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_7_兼容类型和复合类型.md",
            },
            {
              text: "6.2.8 对象的对齐",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_8_对象的对齐.md",
            },
            {
              text: "6.2.9 编码",
              link: "/教程/标准文档翻译/6_语言/6_2_概念/6_2_9_编码.md",
            },
          ],
        },
        {
          text: "6.3 转换",
          link: "/教程/标准文档翻译/6_语言/6_3_转换.md",
          collapsed: true,
          items: [
            {
              text: "6.3.1 算术操作数",
              link: "/教程/标准文档翻译/6_语言/6_3_转换/6_3_1_算术操作数.md",
            },
            {
              text: "6.3.2 其他操作数",
              link: "/教程/标准文档翻译/6_语言/6_3_转换/6_3_2_其他操作数.md",
            },
          ],
        },
        {
          text: "6.4 词法元素",
          link: "/教程/标准文档翻译/6_语言/6_4_词法元素.md",
          collapsed: true,
          items: [
            {
              text: "6.4.1 关键字",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_1_关键字.md",
            },
            {
              text: "6.4.2 标识符",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_2_标识符.md",
            },
            {
              text: "6.4.3 通用字符名",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_3_通用字符名.md",
            },
            {
              text: "6.4.4 常量",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_4_常量.md",
            },
            {
              text: "6.4.5 字符串字面量",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_5_字符串字面量.md",
            },
            {
              text: "6.4.6 标点符号",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_6_标点符号.md",
            },
            {
              text: "6.4.7 头名称",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_7_头名称.md",
            },
            {
              text: "6.4.8 预处理数",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_8_预处理数.md",
            },
            {
              text: "6.4.9 注释",
              link: "/教程/标准文档翻译/6_语言/6_4_词法元素/6_4_9_注释.md",
            },
          ],
        },
        {
          text: "6.5 表达式",
          link: "/教程/标准文档翻译/6_语言/6_5_表达式.md",
          collapsed: true,
          items: [
            {
              text: "6.5.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_1_一般规定.md",
            },
            {
              text: "6.5.2 基本表达式",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_2_基本表达式.md",
            },
            {
              text: "6.5.3 后缀运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_3_后缀运算符.md",
            },
            {
              text: "6.5.4 一元运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_4_一元运算符.md",
            },
            {
              text: "6.5.5 强制转换运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_5_强制转换运算符.md",
            },
            {
              text: "6.5.6 乘法运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_6_乘法运算符.md",
            },
            {
              text: "6.5.7 加法运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_7_加法运算符.md",
            },
            {
              text: "6.5.8 按位移位运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_8_按位移位运算符.md",
            },
            {
              text: "6.5.9 关系运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_9_关系运算符.md",
            },
            {
              text: "6.5.10 相等运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_10_相等运算符.md",
            },
            {
              text: "6.5.11 按位与运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_11_按位与运算符.md",
            },
            {
              text: "6.5.12 按位异或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_12_按位异或运算符.md",
            },
            {
              text: "6.5.13 按位或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_13_按位或运算符.md",
            },
            {
              text: "6.5.14 逻辑与运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_14_逻辑与运算符.md",
            },
            {
              text: "6.5.15 逻辑或运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_15_逻辑或运算符.md",
            },
            {
              text: "6.5.16 条件运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_16_条件运算符.md",
            },
            {
              text: "6.5.17 赋值运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_17_赋值运算符.md",
            },
            {
              text: "6.5.18 逗号运算符",
              link: "/教程/标准文档翻译/6_语言/6_5_表达式/6_5_18_逗号运算符.md",
            },
          ],
        },
        {
          text: "6.6 常量表达式",
          link: "/教程/标准文档翻译/6_语言/6_6_常量表达式.md",
        },
        {
          text: "6.7 声明",
          link: "/教程/标准文档翻译/6_语言/6_7_声明.md",
          collapsed: true,
          items: [
            {
              text: "6.7.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_1_一般规定.md",
            },
            {
              text: "6.7.2 存储类说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_2_存储类说明符.md",
            },
            {
              text: "6.7.3 类型说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_类型说明符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.3.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_1_一般规定.md",
                },
                {
                  text: "6.7.3.2 结构体和联合体说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_2_结构体和联合体说明符.md",
                },
                {
                  text: "6.7.3.3 枚举说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_3_枚举说明符.md",
                },
                {
                  text: "6.7.3.4 标记",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_4_标记.md",
                },
                {
                  text: "6.7.3.5 原子类型说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_5_原子类型说明符.md",
                },
                {
                  text: "6.7.3.6 typeof 说明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_3_6_typeof_说明符.md",
                },
              ],
            },
            {
              text: "6.7.4 类型限定符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_类型限定符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.4.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_1_一般规定.md",
                },
                {
                  text: "6.7.4.2 restrict 的形式化定义",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_4_2_restrict_的形式化定义.md",
                },
              ],
            },
            {
              text: "6.7.5 函数说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_5_函数说明符.md",
            },
            {
              text: "6.7.6 对齐说明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_6_对齐说明符.md",
            },
            {
              text: "6.7.7 声明符",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_声明符.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.7.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_1_一般规定.md",
                },
                {
                  text: "6.7.7.2 指针声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_8_2_指针声明符.md",
                },
                {
                  text: "6.7.7.3 数组声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_3_数组声明符.md",
                },
                {
                  text: "6.7.7.4 函数声明符",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_7_4_函数声明符.md",
                },
              ],
            },
            {
              text: "6.7.8 类型名",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_8_类型名.md",
            },
            {
              text: "6.7.9 类型定义",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_9_类型定义.md",
            },
            {
              text: "6.7.10 类型推导",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_10_类型推导.md",
            },
            {
              text: "6.7.11 初始化",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_11_初始化.md",
            },
            {
              text: "6.7.12 静态断言",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_12_静态断言.md",
            },
            {
              text: "6.7.13 属性",
              link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_属性.md",
              collapsed: true,
              items: [
                {
                  text: "6.7.13.1 引言",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_1_引言.md",
                },
                {
                  text: "6.7.13.2 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_2_一般规定.md",
                },
                {
                  text: "6.7.13.3 nodiscard 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_3_nodiscard_属性.md",
                },
                {
                  text: "6.7.13.4 maybe_unused 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_4_maybe_unused_属性.md",
                },
                {
                  text: "6.7.13.5 deprecated 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_5_deprecated_属性.md",
                },
                {
                  text: "6.7.13.6 fallthrough 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_6_fallthrough_属性.md",
                },
                {
                  text: "6.7.13.7 noreturn 与 _Noreturn 属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_7_noreturn_与_Noreturn_属性.md",
                },
                {
                  text: "6.7.13.8 函数类型的标准属性",
                  link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_8_函数类型的标准属性.md",
                  collapsed: true,
                  items: [
                    {
                      text: "6.7.13.8.1 一般规定",
                      link: "/教程/标准文档翻译/6_语言/6_7_声明/6_7_13_8_1_一般规定.md",
                    },
                  ],
                },
              ],
            },
          ],
        },
        {
          text: "6.8 语句",
          link: "/教程/标准文档翻译/6_语言/6_8_语句.md",
          collapsed: true,
          items: [
            {
              text: "6.8.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_1_一般规定.md",
            },
            {
              text: "6.8.2 带标签语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_2_带标签语句.md",
            },
            {
              text: "6.8.3 复合语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_3_复合语句.md",
            },
            {
              text: "6.8.4 表达式语句和空语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_4_表达式语句和空语句.md",
            },
            {
              text: "6.8.5 选择语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.5.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_1_一般规定.md",
                },
                {
                  text: "6.8.5.2 if 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_2_if_语句.md",
                },
                {
                  text: "6.8.5.3 switch 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_5_选择语句/6_8_5_3_switch_语句.md",
                },
              ],
            },
            {
              text: "6.8.6 迭代语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.6.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_1_一般规定.md",
                },
                {
                  text: "6.8.6.2 while 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_2_while_语句.md",
                },
                {
                  text: "6.8.6.3 do 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_3_do_语句.md",
                },
                {
                  text: "6.8.6.4 for 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_6_迭代语句/6_8_6_4_for_语句.md",
                },
              ],
            },
            {
              text: "6.8.7 跳转语句",
              link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句.md",
              collapsed: true,
              items: [
                {
                  text: "6.8.7.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_1_一般规定.md",
                },
                {
                  text: "6.8.7.2 goto 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_2_goto_语句.md",
                },
                {
                  text: "6.8.7.3 continue 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_3_continue_语句.md",
                },
                {
                  text: "6.8.7.4 break 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_4_break_语句.md",
                },
                {
                  text: "6.8.7.5 return 语句",
                  link: "/教程/标准文档翻译/6_语言/6_8_语句/6_8_7_跳转语句/6_8_7_5_return_语句.md",
                },
              ],
            },
          ],
        },
        {
          text: "6.9 外部定义",
          link: "/教程/标准文档翻译/6_语言/6_9_外部定义.md",
          collapsed: true,
          items: [
            {
              text: "6.9.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_1_一般规定.md",
            },
            {
              text: "6.9.2 函数定义",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_2_函数定义.md",
            },
            {
              text: "6.9.3 外部对象定义",
              link: "/教程/标准文档翻译/6_语言/6_9_外部定义/6_9_3_外部对象定义.md",
            },
          ],
        },
        {
          text: "6.10 预处理指令",
          link: "/教程/标准文档翻译/6_语言/6_10_预处理指令.md",
          collapsed: true,
          items: [
            {
              text: "6.10.1 一般规定",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_1_一般规定.md",
            },
            {
              text: "6.10.2 条件包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_2_条件包含.md",
            },
            {
              text: "6.10.3 源文件包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_3_源文件包含.md",
            },
            {
              text: "6.10.4 二进制资源包含",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.4.1 #embed 预处理指令",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含/6_10_4_1_embed_预处理指令.md",
                },
                {
                  text: "6.10.4.2 limit 参数",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_4_二进制资源包含/6_10_4_2_limit_参数.md",
                },
              ],
            },
            {
              text: "6.10.5 宏替换",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.5.1 实参替换",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_1_实参替换.md",
                },
                {
                  text: "6.10.5.2 # 运算符",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_2_hash_运算符.md",
                },
                {
                  text: "6.10.5.3 ## 运算符",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_3_hashhash_运算符.md",
                },
                {
                  text: "6.10.5.4 重新扫描与进一步替换",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_4_重新扫描与进一步替换.md",
                },
                {
                  text: "6.10.5.5 宏定义的作用域",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_5_宏替换/6_10_5_5_宏定义的作用域.md",
                },
              ],
            },
            {
              text: "6.10.6 行控制",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_6_行控制.md",
            },
            {
              text: "6.10.7 诊断指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_7_诊断指令.md",
            },
            {
              text: "6.10.8 pragma 指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_8_pragma_指令.md",
            },
            {
              text: "6.10.9 空指令",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_9_空指令.md",
            },
            {
              text: "6.10.10 预定义宏名",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名.md",
              collapsed: true,
              items: [
                {
                  text: "6.10.10.1 一般规定",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_1_一般规定.md",
                },
                {
                  text: "6.10.10.2 强制宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_2_强制宏.md",
                },
                {
                  text: "6.10.10.3 环境宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_3_环境宏.md",
                },
                {
                  text: "6.10.10.4 条件特性宏",
                  link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_10_预定义宏名/6_10_10_4_条件特性宏.md",
                },
              ],
            },
            {
              text: "6.10.11 pragma 运算符",
              link: "/教程/标准文档翻译/6_语言/6_10_预处理指令/6_10_11_pragma_运算符.md",
            },
          ],
        },
        {
          text: "6.11 未来语言方向",
          link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向.md",
          collapsed: true,
          items: [
            {
              text: "6.11.1 浮点类型",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_1_浮点类型.md",
            },
            {
              text: "6.11.2 标识符的链接",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_2_标识符的链接.md",
            },
            {
              text: "6.11.3 外部名称",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_3_外部名称.md",
            },
            {
              text: "6.11.4 字符转义序列",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_4_字符转义序列.md",
            },
            {
              text: "6.11.5 存储类说明符",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_5_存储类说明符.md",
            },
            {
              text: "6.11.6 pragma 指令",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_6_pragma_指令.md",
            },
            {
              text: "6.11.7 预定义宏名",
              link: "/教程/标准文档翻译/6_语言/6_11_未来语言方向/6_11_7_预定义宏名.md",
            },
          ],
        },
      ],
      collapsed: false,
    },
    {
      text: "未定义行为列表",
      link: "/教程/标准文档翻译/c_ub_list.md",
    },
  ],
};
